In [1]:
import pandas as pd

In [8]:
!ls

1-wide_vs_long.ipynb          README.md
2-using_the_weather_api.ipynb Untitled.ipynb
3-cleaning_data.ipynb         Untitled1.ipynb
4-reshaping_data.ipynb        Untitled2.ipynb
5-handling_data_issues.ipynb  data
Exercises_ch_03.ipynb         exercises

In [9]:
!ls exercises

README.md               covid19_cases.csv       goog.csv
aapl.csv                covid19_total_cases.csv nflx.csv
amzn.csv                fb.csv

In [11]:
!head -2 exercises/aapl.csv

date,high,low,open,close,volume
2018-01-02,43.07500076293945,42.31499862670898,42.540000915527344,43.06499862670898,102223600.0
2018-01-03,43.63750076293945,42.9900016784668,43.13249969482422,43.057498931884766,118071600.0

In [12]:
!head -2 exercises/amzn.csv

date,high,low,open,close,volume
2018-01-02,1190.0,1170.510009765625,1172.0,1189.010009765625,2694500
2018-01-03,1205.489990234375,1188.300048828125,1188.300048828125,1204.199951171875,3108800

In [14]:
!head -2 exercises/goog.csv

date,high,low,open,close,volume
2018-01-02,1066.93994140625,1045.22998046875,1048.3399658203125,1065.0,1237600
2018-01-03,1086.2900390625,1063.2099609375,1064.31005859375,1082.47998046875,1430200

In [16]:
!head -2 exercises/fb.csv

date,high,low,open,close,volume
2018-01-02,181.5800018310547,177.5500030517578,177.67999267578125,181.4199981689453,18151900

In [378]:
aapl_df = pd.read_csv('exercises/aapl.csv', index_col= 'date', parse_dates=['date'])

In [379]:
aapl_df.head(3)

                 high        low       open      close       volume
date
2018-01-02  43.075001  42.314999  42.540001  43.064999  102223600.0
2018-01-03  43.637501  42.990002  43.132500  43.057499  118071600.0
2018-01-04  43.367500  43.020000  43.134998  43.257500   89738400.0

In [380]:
aapl_df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 251 entries, 2018-01-02 to 2018-12-31
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   high    251 non-null    float64
 1   low     251 non-null    float64
 2   open    251 non-null    float64
 3   close   251 non-null    float64
 4   volume  251 non-null    float64
dtypes: float64(5)
memory usage: 11.8 KB

The index seems to be a datetime object. So the read of this file seems to work as I wanted it to. Repeat on the other stocks.

In [381]:
goog_df = pd.read_csv('exercises/goog.csv', index_col= 'date', parse_dates=['date'])
fb_df = pd.read_csv('exercises/fb.csv', index_col= 'date', parse_dates=['date'])
amzn_df = pd.read_csv('exercises/amzn.csv', index_col= 'date', parse_dates=['date'])
nflx_df = pd.read_csv('exercises/nflx.csv', index_col= 'date', parse_dates=['date'])

In [382]:
aapl_df['ticker'] = 'AAPL'
goog_df['ticker'] = 'GOOG'
fb_df['ticker'] = 'FB'
amzn_df['ticker'] = 'AMZN'
nflx_df['ticker'] = 'NFLX'

In [383]:
faang = pd.concat([aapl_df, goog_df, fb_df, amzn_df, nflx_df])

In [384]:
faang.head(3)

                 high        low       open      close       volume ticker
date
2018-01-02  43.075001  42.314999  42.540001  43.064999  102223600.0   AAPL
2018-01-03  43.637501  42.990002  43.132500  43.057499  118071600.0   AAPL
2018-01-04  43.367500  43.020000  43.134998  43.257500   89738400.0   AAPL

In [385]:
faang.ticker.unique()

array(['AAPL', 'GOOG', 'FB', 'AMZN', 'NFLX'], dtype=object)

In [386]:
faang.shape

(1255, 6)

In [387]:
cols = faang.columns.tolist()
cols = cols[-1:] + cols[0:-1]
print(cols)

['ticker', 'high', 'low', 'open', 'close', 'volume']

In [388]:
# reorder columns with ticker as the leftmost column
faang = faang[cols]

How would I have done this with column numbers instead of column names?

From this [post](https://stackoverflow.com/questions/13148429/how-to-change-the-order-of-dataframe-columns#:~:text=You%20need%20to%20create%20a,columns%20in%20this%20new%20order.) on stackoverflow, it looks like it's just a matter of providing position numbers.

In [389]:
# create another faang dataframe for this experiment
faang2 = pd.concat([aapl_df, goog_df, fb_df, amzn_df, nflx_df])
faang2.columns.tolist()

['high', 'low', 'open', 'close', 'volume', 'ticker']

In [390]:
num_cols = len(faang2.columns.tolist())
new_order = [-1] + list(range(0,num_cols-1))
print("new column number ordering: ", new_order)

new column number ordering:  [-1, 0, 1, 2, 3, 4]

In [391]:
faang2 = faang2[faang2.columns[new_order]]

In [392]:
faang2.head()

           ticker       high        low       open      close       volume
date
2018-01-02   AAPL  43.075001  42.314999  42.540001  43.064999  102223600.0
2018-01-03   AAPL  43.637501  42.990002  43.132500  43.057499  118071600.0
2018-01-04   AAPL  43.367500  43.020000  43.134998  43.257500   89738400.0
2018-01-05   AAPL  43.842499  43.262501  43.360001  43.750000   94640000.0
2018-01-08   AAPL  43.902500  43.482498  43.587502  43.587502   82271200.0

**It Worked! Both ways!**

In [393]:
csv_data = faang.to_csv('exercises/faang.csv')

In [394]:
!ls exercises

README.md               covid19_cases.csv       fb.csv
aapl.csv                covid19_total_cases.csv goog.csv
amzn.csv                faang.csv               nflx.csv

In [395]:
!head -3 exercises/faang.csv

date,ticker,high,low,open,close,volume
2018-01-02,AAPL,43.07500076293945,42.31499862670898,42.540000915527344,43.06499862670898,102223600.0
2018-01-03,AAPL,43.63750076293945,42.9900016784668,43.13249969482422,43.057498931884766,118071600.0

In [396]:
faang.dtypes

ticker     object
high      float64
low       float64
open      float64
close     float64
volume    float64
dtype: object

##### **2) With faang, use type conversion to cast the values of the date column into datetimes and the volume column into integers. Then, sort by date and ticker.**

Already imported `date` as datetime.

In [397]:
faang.head(3)

           ticker       high        low       open      close       volume
date
2018-01-02   AAPL  43.075001  42.314999  42.540001  43.064999  102223600.0
2018-01-03   AAPL  43.637501  42.990002  43.132500  43.057499  118071600.0
2018-01-04   AAPL  43.367500  43.020000  43.134998  43.257500   89738400.0

In [398]:
faang.volume = faang.volume.astype('int')

In [399]:
faang.head(3)

           ticker       high        low       open      close     volume
date
2018-01-02   AAPL  43.075001  42.314999  42.540001  43.064999  102223600
2018-01-03   AAPL  43.637501  42.990002  43.132500  43.057499  118071600
2018-01-04   AAPL  43.367500  43.020000  43.134998  43.257500   89738400

In [400]:
faang.tail(3)

           ticker        high         low        open       close    volume
date
2018-12-27   NFLX  255.589996  240.100006  250.110001  255.570007  12235200
2018-12-28   NFLX  261.910004  249.800003  257.940002  256.079987  10992800
2018-12-31   NFLX  270.100006  260.000000  260.160004  267.660004  13508900

In [401]:
faang.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1255 entries, 2018-01-02 to 2018-12-31
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ticker  1255 non-null   object
 1   high    1255 non-null   float64
 2   low     1255 non-null   float64
 3   open    1255 non-null   float64
 4   close   1255 non-null   float64
 5   volume  1255 non-null   int64
dtypes: float64(4), int64(1), object(1)
memory usage: 68.6+ KB

In [402]:
# sort first by date and then by ticker
faang.sort_index(inplace=True)
faang.sort_values('ticker', inplace=True)

In [403]:
faang.head(3)

           ticker       high        low       open      close     volume
date
2018-01-02   AAPL  43.075001  42.314999  42.540001  43.064999  102223600
2018-09-21   AAPL  55.340000  54.322498  55.195000  54.415001  384986800
2018-09-24   AAPL  55.314999  54.157501  54.205002  55.197498  110773600

I think making the `date` column an index has made the 'first, sort by date, then by ticker' harder than it should be. So let's make the date a column again. `reset_index()` seems to make this really easy.

In [404]:
faang.reset_index(inplace=True)
faang.head(3)

        date ticker       high        low       open      close     volume
0 2018-01-02   AAPL  43.075001  42.314999  42.540001  43.064999  102223600
1 2018-09-21   AAPL  55.340000  54.322498  55.195000  54.415001  384986800
2 2018-09-24   AAPL  55.314999  54.157501  54.205002  55.197498  110773600

In [405]:
faang.sort_values(by=['date', 'ticker'], inplace=True)
faang.head(10)

,date,ticker,high,low,open,close,volume
0,2018-01-02,AAPL,43.075001,42.314999,42.540001,43.064999,102223600
301,2018-01-02,AMZN,1190.000000,1170.510010,1172.000000,1189.010010,2694500
740,2018-01-02,FB,181.580002,177.550003,177.679993,181.419998,18151900
958,2018-01-02,GOOG,1066.939941,1045.229980,1048.339966,1065.000000,1237600
1020,2018-01-02,NFLX,201.649994,195.419998,196.100006,201.070007,10966900
237,2018-01-03,AAPL,43.637501,42.990002,43.132500,43.057499,118071600
314,2018-01-03,AMZN,1205.489990,1188.300049,1188.300049,1204.199951,3108800
748,2018-01-03,FB,184.779999,181.330002,181.880005,184.669998,16886600
996,2018-01-03,GOOG,1086.290039,1063.209961,1064.310059,1082.479980,1430200
1015,2018-01-03,NFLX,206.210007,201.500000,202.050003,205.050003,8591400

##### **3) Find the seven rows in faang with the lowest value for volume.**

In [406]:
faang.volume.nsmallest(7)

957    679000
836    691500
876    766800
980    798400
880    848600
983    870800
972    887400
Name: volume, dtype: int64

In [407]:
faang.nsmallest(7, 'volume')

,date,ticker,high,low,open,close,volume
957,2018-07-03,GOOG,1135.819946,1100.020020,1135.819946,1102.890015,679000
836,2018-11-23,GOOG,1037.589966,1022.398987,1030.000000,1023.880005,691500
876,2018-05-24,GOOG,1080.469971,1066.150024,1079.000000,1079.239990,766800
980,2018-07-10,GOOG,1159.589966,1149.589966,1156.979980,1152.839966,798400
880,2018-08-09,GOOG,1255.541992,1246.010010,1249.900024,1249.099976,848600
983,2018-08-20,GOOG,1211.000000,1194.625977,1205.020020,1207.770020,870800
972,2018-08-22,GOOG,1211.839966,1199.000000,1200.000000,1207.329956,887400

##### **4) Right now, the data is somewhere between long and wide format. Use `melt()` to make it completely long format. Hint: `date` and `ticker` are our ID variables (they uniquely identify each row). We need to melt the rest so that we don't have separate columns for `open`, `high`, `low`, `close`, and `volume`.**

In [327]:
faang_lg = faang.melt(id_vars=['date', 'ticker'], value_vars=['high', 'low', 'open', 'close', 'volume'])

In [328]:
faang_lg.head(10)

        date ticker variable        value
0 2018-01-02   AAPL     high    43.075001
1 2018-01-02   AMZN     high  1190.000000
2 2018-01-02     FB     high   181.580002
3 2018-01-02   GOOG     high  1066.939941
4 2018-01-02    NaN     high   201.649994
5 2018-01-03   AAPL     high    43.637501
6 2018-01-03   AMZN     high  1205.489990
7 2018-01-03     FB     high   184.779999
8 2018-01-03   GOOG     high  1086.290039
9 2018-01-03    NaN     high   206.210007

In [329]:
faang_lg.tail(10)

           date ticker variable        value
6265 2018-12-28   AAPL   volume  169165600.0
6266 2018-12-28   AMZN   volume    8829000.0
6267 2018-12-28     FB   volume   22627600.0
6268 2018-12-28   GOOG   volume    1414800.0
6269 2018-12-28    NaN   volume   10992800.0
6270 2018-12-31   AAPL   volume  140014000.0
6271 2018-12-31   AMZN   volume    6954500.0
6272 2018-12-31     FB   volume   24625300.0
6273 2018-12-31   GOOG   volume    1493300.0
6274 2018-12-31    NaN   volume   13508900.0

Set the index to `date` again.

In [330]:
faang_lg.set_index('date', inplace=True)
faang_lg.head()

           ticker variable        value
date
2018-01-02   AAPL     high    43.075001
2018-01-02   AMZN     high  1190.000000
2018-01-02     FB     high   181.580002
2018-01-02   GOOG     high  1066.939941
2018-01-02    NaN     high   201.649994

##### **5) Suppose we found out that on July 26, 2018 there was a glitch in how the data was recorded. How should we handle this? Note that there is no coding required for this exercise.**

I would keep the date in, but assign the values to NaN.

##### **6) The European Centre for Disease Prevention and Control (ECDC) provides an open dataset on COVID-19 cases called daily number of new reported cases of COVID-19 by country worldwide (https://www.ecdc.europa.eu/en/publications-data/download-todays-data-geographic-distribution-covid-19-cases-worldwide). This dataset is updated daily, but we will use a snapshot that contains data from January 1, 2020 through September 18, 2020. Clean and pivot the data so that it is in wide format:**

In [331]:
!ls exercises

README.md               covid19_cases.csv       fb.csv
aapl.csv                covid19_total_cases.csv goog.csv
amzn.csv                faang.csv               nflx.csv

In [332]:
!head -3 'exercises/covid19_cases.csv'

dateRep,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2019,continentExp,Cumulative_number_for_14_days_of_COVID-19_cases_per_100000
01/01/2020,1,1,2020,0,0,Lithuania,LT,LTU,2794184.0,Europe,
01/01/2020,1,1,2020,0,0,Iceland,IS,ISL,356991.0,Europe,

##### **6a) Read in the covid19_cases.csv file.**

In [333]:
c19 = pd.read_csv('exercises/covid19_cases.csv')

In [334]:
c19.head(3)

,dateRep,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2019,continentExp,Cumulative_number_for_14_days_of_COVID-19_cases_per_100000
0,01/01/2020,1,1,2020,0,0,Lithuania,LT,LTU,2794184.0,Europe,NaN
1,01/01/2020,1,1,2020,0,0,Iceland,IS,ISL,356991.0,Europe,NaN
2,01/01/2020,1,1,2020,0,0,Nepal,NP,NPL,28608715.0,Asia,NaN

In [335]:
c19.shape

(43443, 12)

##### **6b) Create a date column using the data in the dateRep column and the pd.to_datetime() function.**

In [336]:
c19 = c19.assign(
    date = pd.to_datetime(c19.dateRep, dayfirst=True)
)

In [337]:
c19.head(3)

,dateRep,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2019,continentExp,Cumulative_number_for_14_days_of_COVID-19_cases_per_100000,date
0,01/01/2020,1,1,2020,0,0,Lithuania,LT,LTU,2794184.0,Europe,NaN,2020-01-01
1,01/01/2020,1,1,2020,0,0,Iceland,IS,ISL,356991.0,Europe,NaN,2020-01-01
2,01/01/2020,1,1,2020,0,0,Nepal,NP,NPL,28608715.0,Asia,NaN,2020-01-01

In [338]:
c19.tail(3) # has dates that will only be correct if parsed correctly

,dateRep,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2019,continentExp,Cumulative_number_for_14_days_of_COVID-19_cases_per_100000,date
43440,18/09/2020,18,9,2020,90,0,Bahamas,BS,BHS,389486.0,America,203.088173,2020-09-18
43441,18/09/2020,18,9,2020,0,0,Isle_of_Man,IM,IMN,84589.0,Europe,3.546560,2020-09-18
43442,18/09/2020,18,9,2020,34,8,Australia,AU,AUS,25203200.0,Oceania,3.031361,2020-09-18

##### **6c) Set the date column as the index and sort the index.**

In [339]:
c19 = c19.set_index('date')
c19 = c19.drop(['dateRep'], axis = 1) # drop dateRep
c19.head(3) # insure it worked

,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2019,continentExp,Cumulative_number_for_14_days_of_COVID-19_cases_per_100000
date,,,,,,,,,,,
2020-01-01,1,1,2020,0,0,Lithuania,LT,LTU,2794184.0,Europe,NaN
2020-01-01,1,1,2020,0,0,Iceland,IS,ISL,356991.0,Europe,NaN
2020-01-01,1,1,2020,0,0,Nepal,NP,NPL,28608715.0,Asia,NaN

In [340]:
# sort the index
c19 = c19.sort_index()

In [341]:
c19.head(3)

,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2019,continentExp,Cumulative_number_for_14_days_of_COVID-19_cases_per_100000
date,,,,,,,,,,,
2020-01-01,1,1,2020,0,0,Lithuania,LT,LTU,2794184.0,Europe,NaN
2020-01-01,1,1,2020,0,0,Iceland,IS,ISL,356991.0,Europe,NaN
2020-01-01,1,1,2020,0,0,Nepal,NP,NPL,28608715.0,Asia,NaN

In [342]:
c19.dtypes

day                                                             int64
month                                                           int64
year                                                            int64
cases                                                           int64
deaths                                                          int64
countriesAndTerritories                                        object
geoId                                                          object
countryterritoryCode                                           object
popData2019                                                   float64
continentExp                                                   object
Cumulative_number_for_14_days_of_COVID-19_cases_per_100000    float64
dtype: object

In [343]:
c19.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 43443 entries, 2020-01-01 to 2020-09-18
Data columns (total 11 columns):
 #   Column                                                      Non-Null Count  Dtype
---  ------                                                      --------------  -----
 0   day                                                         43443 non-null  int64
 1   month                                                       43443 non-null  int64
 2   year                                                        43443 non-null  int64
 3   cases                                                       43443 non-null  int64
 4   deaths                                                      43443 non-null  int64
 5   countriesAndTerritories                                     43443 non-null  object
 6   geoId                                                       43255 non-null  object
 7   countryterritoryCode                                        43380 non-null  object
 8   popData2019                                                 43380 non-null  float64
 9   continentExp                                                43443 non-null  object
 10  Cumulative_number_for_14_days_of_COVID-19_cases_per_100000  40729 non-null  float64
dtypes: float64(2), int64(5), object(4)
memory usage: 4.0+ MB

##### **6d) Replace all occurrences of United_States_of_America and United_Kingdom with USA and UK, respectively. Hint: the replace() method can be run on the dataframe as a whole.**

In [344]:
c19 = c19.replace({'United_States_of_America': 'USA', 'United_Kingdom': 'UK' })

In [345]:
c19[c19.countriesAndTerritories	== 'USA'].head()

,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2019,continentExp,Cumulative_number_for_14_days_of_COVID-19_cases_per_100000
date,,,,,,,,,,,
2020-01-01,1,1,2020,0,0,USA,US,USA,329064917.0,America,NaN
2020-01-02,2,1,2020,0,0,USA,US,USA,329064917.0,America,NaN
2020-01-03,3,1,2020,0,0,USA,US,USA,329064917.0,America,NaN
2020-01-04,4,1,2020,0,0,USA,US,USA,329064917.0,America,NaN
2020-01-05,5,1,2020,0,0,USA,US,USA,329064917.0,America,NaN

##### **6e) Using the countriesAndTerritories column, filter the cleaned COVID-19 cases data down to Argentina, Brazil, China, Colombia, India, Italy, Mexico, Peru, Russia, Spain, Turkey, the UK, and the USA.**

In [410]:
country_list = ['Argentina', 'Brazil', 'China', 'Colombia', 'India', 'Italy',\
                'Mexico','Peru', 'Russia', 'Spain', 'Turkey', 'UK', 'USA']

c19_largest = c19[c19.countriesAndTerritories.isin(country_list)]

##### **6f) Pivot the data so that the index contains the dates, the columns contain the country names, and the values are the case counts (the cases column). Be sure to fill in NaN values with 0.**

In [411]:
c19_largest.pivot( columns='countriesAndTerritories', values='cases').fillna(0)

countriesAndTerritories,Argentina,Brazil,China,Colombia,India,Italy,Mexico,Peru,Russia,Spain,Turkey,UK,USA
date,,,,,,,,,,,,,
2020-01-01,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2020-01-02,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2020-01-03,0.0,0.0,17.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2020-01-04,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2020-01-05,0.0,0.0,15.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2020-09-14,10778.0,14768.0,29.0,7355.0,92071.0,1456.0,4408.0,6787.0,5449.0,27404.0,1527.0,3330.0,33871.0
2020-09-15,9056.0,15155.0,22.0,5573.0,83809.0,1008.0,3335.0,4241.0,5509.0,9437.0,1716.0,2621.0,34841.0
2020-09-16,9908.0,36653.0,24.0,6698.0,90123.0,1229.0,4771.0,4160.0,5529.0,11193.0,1742.0,3103.0,51473.0
2020-09-17,11893.0,36820.0,7.0,7787.0,97894.0,1452.0,4444.0,6380.0,5670.0,11291.0,1771.0,3991.0,24598.0
2020-09-18,11674.0,36303.0,44.0,7568.0,96424.0,1583.0,3182.0,5698.0,5762.0,14389.0,1648.0,3395.0,43567.0

##### **7) In order to determine the case totals per country efficiently, we need the aggregation skills we will learn about in Chapter 4, Aggregating Pandas DataFrames, so the ECDC data in the covid19_cases.csv file has been aggregated for us and saved in the covid19_total_cases.csv file. It contains the total number of cases per country. Use this data to find the 20 countries with the largest COVID-19 case totals. Hints: when reading in the CSV file, pass in index_col='cases', and note that it will be helpful to transpose the data before isolating the countries.**

In [348]:
!ls exercises

README.md               covid19_cases.csv       fb.csv
aapl.csv                covid19_total_cases.csv goog.csv
amzn.csv                faang.csv               nflx.csv

In [349]:
!head -2 exercises/covid19_total_cases.csv

index,Afghanistan,Albania,Algeria,Andorra,Angola,Anguilla,Antigua_and_Barbuda,Argentina,Armenia,Aruba,Australia,Austria,Azerbaijan,Bahamas,Bahrain,Bangladesh,Barbados,Belarus,Belgium,Belize,Benin,Bermuda,Bhutan,Bolivia,"Bonaire, Saint Eustatius and Saba",Bosnia_and_Herzegovina,Botswana,Brazil,British_Virgin_Islands,Brunei_Darussalam,Bulgaria,Burkina_Faso,Burundi,Cambodia,Cameroon,Canada,Cape_Verde,Cases_on_an_international_conveyance_Japan,Cayman_Islands,Central_African_Republic,Chad,Chile,China,Colombia,Comoros,Congo,Costa_Rica,Cote_dIvoire,Croatia,Cuba,Curaçao,Cyprus,Czechia,Democratic_Republic_of_the_Congo,Denmark,Djibouti,Dominica,Dominican_Republic,Ecuador,Egypt,El_Salvador,Equatorial_Guinea,Eritrea,Estonia,Eswatini,Ethiopia,Falkland_Islands_(Malvinas),Faroe_Islands,Fiji,Finland,France,French_Polynesia,Gabon,Gambia,Georgia,Germany,Ghana,Gibraltar,Greece,Greenland,Grenada,Guam,Guatemala,Guernsey,Guinea,Guinea_Bissau,Guyana,Haiti,Holy_See,Honduras,Hungary,Iceland,India,Indonesia,Iran,Iraq,Ireland,Isle_of_Man,Israel,Italy,Jamaica,Japan,Jersey,Jordan,Kazakhstan,Kenya,Kosovo,Kuwait,Kyrgyzstan,Laos,Latvia,Lebanon,Lesotho,Liberia,Libya,Liechtenstein,Lithuania,Luxembourg,Madagascar,Malawi,Malaysia,Maldives,Mali,Malta,Mauritania,Mauritius,Mexico,Moldova,Monaco,Mongolia,Montenegro,Montserrat,Morocco,Mozambique,Myanmar,Namibia,Nepal,Netherlands,New_Caledonia,New_Zealand,Nicaragua,Niger,Nigeria,North_Macedonia,Northern_Mariana_Islands,Norway,Oman,Pakistan,Palestine,Panama,Papua_New_Guinea,Paraguay,Peru,Philippines,Poland,Portugal,Puerto_Rico,Qatar,Romania,Russia,Rwanda,Saint_Kitts_and_Nevis,Saint_Lucia,Saint_Vincent_and_the_Grenadines,San_Marino,Sao_Tome_and_Principe,Saudi_Arabia,Senegal,Serbia,Seychelles,Sierra_Leone,Singapore,Sint_Maarten,Slovakia,Slovenia,Somalia,South_Africa,South_Korea,South_Sudan,Spain,Sri_Lanka,Sudan,Suriname,Sweden,Switzerland,Syria,Taiwan,Tajikistan,Thailand,Timor_Leste,Togo,Trinidad_and_Tobago,Tunisia,Turkey,Turks_and_Caicos_islands,USA,Uganda,Ukraine,United_Arab_Emirates,UK,United_Republic_of_Tanzania,United_States_Virgin_Islands,Uruguay,Uzbekistan,Venezuela,Vietnam,Western_Sahara,Yemen,Zambia,Zimbabwe
cases,38919,12073,49413,1564,3789,3,95,601700,46910,3460,26861,37191,38894,3177,63189,345805,185,75230,99555,1590,2280,178,258,130051,36,24892,2567,4495183,69,145,18733,1797,473,275,20371,141911,5141,696,209,4786,1147,442827,90308,750471,470,4980,62374,19200,14513,5004,228,1565,46262,10456,21847,5403,24,106732,124129,101772,27346,5002,364,2814,5215,67515,13,430,32,8858,428696,1209,8696,3485,3306,270070,45857,343,14738,14,24,2045,84344,254,10231,2303,2102,8600,12,70611,16920,2230,5308014,236519,416198,311690,32271,339,179071,294932,4571,78073,393,4344,138013,36724,14939,98528,45335,23,1498,27518,1327,1334,26438,112,3565,7718,15971,5716,10147,9568,2991,2634,7361,366,688954,45648,191,311,7711,13,97264,6264,4621,10207,61593,89959,26,1460,4961,1182,56956,16417,62,12645,91753,305031,44037,104879,516,32127,756412,279526,77328,67176,39684,122917,110217,1091186,4671,17,27,64,723,908,328720,14645,32757,141,2153,57543,574,6256,4195,3390,657627,22893,2609,640040,3281,13535,4691,88237,49171,3731,506,9259,3500,27,1640,3651,8570,299810,667,6724667,5594,169472,83433,385936,509,1242,1890,50253,65174,1068,766,2024,14022,7647

In [414]:
c19tot = pd.read_csv('exercises/covid19_total_cases.csv', index_col='index')

In [415]:
c19tot.head()

,Afghanistan,Albania,Algeria,Andorra,Angola,Anguilla,Antigua_and_Barbuda,Argentina,Armenia,Aruba,...,United_Republic_of_Tanzania,United_States_Virgin_Islands,Uruguay,Uzbekistan,Venezuela,Vietnam,Western_Sahara,Yemen,Zambia,Zimbabwe
index,,,,,,,,,,,,,,,,,,,,,
cases,38919,12073,49413,1564,3789,3,95,601700,46910,3460,...,509,1242,1890,50253,65174,1068,766,2024,14022,7647

In [416]:
c19tot= c19tot.T

In [417]:
c19tot.head()

index        cases
Afghanistan  38919
Albania      12073
Algeria      49413
Andorra       1564
Angola        3789

In [354]:
#c19tot.rename(columns = {0: 'cases'}, inplace=True)

In [355]:
#c19tot.drop('index', inplace=True)

In [356]:
#c19tot.head()

             cases
Afghanistan  38919
Albania      12073
Algeria      49413
Andorra       1564
Angola        3789

In [418]:
c19tot.dtypes # !not integers!

index
cases    int64
dtype: object

In [419]:
#c19tot.cases = c19tot.cases.astype('int')

In [420]:
c19top20 = c19tot.cases.nlargest(20)

In [360]:
# w/the right libraries, this is how to format individual columns in a dataframe
# c19top20.to_frame().style.format({
#     "cases": "{:,}"})

In [421]:
c19top20.to_frame().sort_values('cases', ascending=False)

                cases
USA           6724667
India         5308014
Brazil        4495183
Russia        1091186
Peru           756412
Colombia       750471
Mexico         688954
South_Africa   657627
Spain          640040
Argentina      601700
Chile          442827
France         428696
Iran           416198
UK             385936
Bangladesh     345805
Saudi_Arabia   328720
Iraq           311690
Pakistan       305031
Turkey         299810
Italy          294932